## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`


**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.masked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_server_metrics_event_rule-terraform-20210702182404782300000005"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_server_metrics:14" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_server_metrics:14" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest" -> "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/server-metrics-etl:latest"
                    # (10 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_server_metrics" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_server_metrics_event_rule-terraform-20210702182404726800000003"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_server_metrics:14" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_server_metrics:14" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest" -> "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/server-metrics-etl:latest"
                    # (10 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_server_metrics" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>